var locations = [{
        lat: 31.8192778,
        lng: 35.2394908,
        label: 'תחנת רכבת קלה יקותיאל אדם פסגת זאב מערב'
        }, 
        {lat: 31.8209677,
        lng: 35.2418900,
        label: 'פארק'
    }, {
        lat: 31.8241515,
        lng: 35.2378828,
        label: 'מרכז קהילתי'
    }, {
        lat: 31.8253685,
        lng: 35.2398462,
        label: 'חדר כושר'
    }, {
        lat: 31.8229619,
        lng: 35.2434243,
        label: 'פסל הלטאה'
    }, {
        lat: 31.8191878,
        lng: 35.2443416,
        label: 'תיכון מדעים ואמנויות'
    }, {
        lat: 31.8186225,
        lng: 35.2509291,
        label: 'משחקיה'
    },
    {
        lat: 31.8176015,
        lng: 35.2486760,
        label: 'בית כנסת'
    },
    {
        lat: 31.8316543,
        lng: 35.2421170,
        label: 'מגרש משחקים'
    },
    {
        lat: 31.8308521,
        lng: 35.2418703,
        label: 'פארק ארכיאולוגי'
    },
    {
        lat: 31.8278714,
        lng: 35.2407223,
        label: 'מצבת גדוד מוריה'
    },
    {
        lat: 31.8322229,
        lng: 35.2341326,
        label: 'מיתקן ספורט פיסגת זאב'
    },
    {
        lat: 31.8207161,
        lng: 35.2494105,
        label: 'בית כנסת בית יצחק'
    },
    {
        lat: 31.8201873,
        lng: 35.2563091,
        label: 'בית הכנסת יוסף חי'
    },
    {
        lat: 31.8412436,
        lng: 35.2417975,
        label: 'גינת משחקים'
    },
    {
        lat: 32.0334507,
        lng: 34.7445459,
        label: 'בית כנסת זכרון קדושים'
    },
    {
        lat: 32.0339783,
        lng: 34.7469491,
        label: 'גן בית דניאל'
    },
    {
        lat: 32.0381438,
        lng: 34.7458763,
        label: 'חוף גבעת עליה'
    },
    {
        lat: 32.0376527,
        lng: 34.7479898,
        label: 'המסגד'
    },
    {
        lat: 32.0377436,
        lng: 34.7484297,
        label: 'הגשר הערבי'
    },
    {
        lat: 32.0382256,
        lng: 34.7522277,
        label: 'משחקיה'
    },
    {
        lat: 32.0375617,
        lng: 34.7544808,
        label: 'מרכז כדורגל וספורט'
    },
    {
        lat: 32.0361571,
        lng: 34.7572135,
        label: 'משחקיה'
    },
    {
        lat: 32.0355478,
        lng: 34.7597402,
        label: 'תחנת רכבת וופסון'
    },
    {
        lat: 32.0331194,
        lng: 34.7587102,
        label: 'פארק פרלה ולאון'
    },
    {
        lat:32.035835,
        lng:34.7493449,
        label: 'בית הכנסת רבי מאיר בעל הנס',
        icon:'https://vignette.wikia.nocookie.net/pokemongo/images/7/71/Larvitar.png/revision/latest/scale-to-width-down/128?cb=20180409130100'
    }
];

