var locations = [{
        lat: 31.8192778,
        lng: 35.2394908,
        label: 'תחנת רכבת קלה יקותיאל אדם פסגת זאב מערב'
        }, 
        {lat: 31.8209677,
        lng: 35.2418900,
        label: 'פארק'
    }, {
        lat: 31.8241515,
        lng: 35.2378828,
        label: 'מרכז קהילתי'
    }, {
        lat: 31.8253685,
        lng: 35.2398462,
        label: 'חדר כושר'
    }, {
        lat: 31.8229619,
        lng: 35.2434243,
        label: 'פסל הלטאה'
    }, {
        lat: 31.8191878,
        lng: 35.2443416,
        label: 'תיכון מדעים ואמנויות'
    }, {
        lat: 31.8186225,
        lng: 35.2509291,
        label: 'משחקיה'
    },
    {
        lat: 31.8176015,
        lng: 35.2486760,
        label: 'בית כנסת'
    }
]



var barLocations = [
    ['Gambari', 32.053875, 34.755612, 7],
    ['El Jamila', 32.053986, 34.755913, 6],
    ['Anna Loulou Bar', 32.053399, 34.753853, 5],
    ['Shaffa Bar', 32.053017, 34.755967, 4],
    ['Cafe Puaa', 32.052635, 34.756171, 3],
    ['Dr Shakshuka', 32.054350, 34.756470, 2],
    ['Urbano', 32.054062, 34.755628, 1]
];